app/controllers/pokedex_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def viewEntry
    puts "--------In view Pokemon--------"
    number = params[:numberInput]
    entry = {"Number" => number}
    @pokemons = Pokemon.all