app/controllers/pokemons_controller.rb

  def index
    @myPokemon = []
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def viewMyPokemon
    @myPokemon = []
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def viewMyShiny
    @myShinyPokemon = []
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def viewNotCaught
    @notMyPokemon = []
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def findPokemon
    puts "----- find pokemon------"
    @poke = File.read("justForPassing.txt")
    @allPokemon = File.read("allPokemon.txt")
    @allPokemon = @allPokemon.split("\n")
    @pokemonList = []
    @allPokemon.each do |x|
---
SELECT "pokemons".* FROM "pokemons"

  def create
    realPokemon = false
    @pokemon = Pokemon.new(pokemon_params)
    @allPokemon = File.read("allPokemon.txt")
    @pokemonList = @allPokemon.split("\n")
    @pokemonList.each do |x|
      if x == @pokemon.Name
        realPokemon = true
      end
    end
    respond_to do |format|
      if realPokemon == false
        format.html { redirect_to @pokemon, notice: 'Pokémon could not be created; not a valid Pokémon'}
        format.json { render json: @pokemon.errors, status: :unprocessable_entity }
      elsif @pokemon.save
---
INSERT INTO "pokemons" ("Number", "Name", "Type", "Level", "Ability", "Height", "Weight", "Gender", "Caught", "Location_Caught", "Level_Caught", "Shiny", "PC", "Can_Evolve", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      @allPokemon = File.read("allPokemon.txt")
      @pokemonList = @allPokemon.split("\n")
      realPokemon = false
      @pokemonList.each do |x|
      if x == pokemon_params[:Name]
        realPokemon = true
        end
      end
      if realPokemon == false
        format.html { redirect_to @pokemon, notice: 'Pokémon could not be updated; not a valid Pokémon'}
        format.json { render json: @pokemon.errors, status: :unprocessable_entity }
      elsif @pokemon.update(pokemon_params)
---
UPDATE "pokemons" SET "Caught" = ?, "Location_Caught" = ?, "Level_Caught" = ?, "PC" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["Caught", "t"], ["Location_Caught", "Pallet Town"], ["Level_Caught", 5], ["PC", "t"], ["updated_at", "2015-12-18 01:52:54.242659"], ["id", 65]]

  def destroy
    @pokemon.destroy
---
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 2]]